cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51P.svd
        <register>
          <name>PENDCH</name>
          <description>Pending Channels</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PENDCH0</name>
              <description>Pending Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH1</name>
              <description>Pending Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH2</name>
              <description>Pending Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH3</name>
              <description>Pending Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH4</name>
              <description>Pending Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH5</name>
              <description>Pending Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH6</name>
              <description>Pending Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH7</name>
              <description>Pending Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH8</name>
              <description>Pending Channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH9</name>
              <description>Pending Channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH10</name>
              <description>Pending Channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH11</name>
              <description>Pending Channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH12</name>
              <description>Pending Channel 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH13</name>
              <description>Pending Channel 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH14</name>
              <description>Pending Channel 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH15</name>
              <description>Pending Channel 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH16</name>
              <description>Pending Channel 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH17</name>
              <description>Pending Channel 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH18</name>
              <description>Pending Channel 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH19</name>
              <description>Pending Channel 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH20</name>
              <description>Pending Channel 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH21</name>
              <description>Pending Channel 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH22</name>
              <description>Pending Channel 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH23</name>
              <description>Pending Channel 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH24</name>
              <description>Pending Channel 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH25</name>
              <description>Pending Channel 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH26</name>
              <description>Pending Channel 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH27</name>
              <description>Pending Channel 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH28</name>
              <description>Pending Channel 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH29</name>
              <description>Pending Channel 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH30</name>
              <description>Pending Channel 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH31</name>
              <description>Pending Channel 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE</name>
          <description>Active Channel and Levels</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LVLEX0</name>
              <description>Level 0 Channel Trigger Request Executing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX1</name>
              <description>Level 1 Channel Trigger Request Executing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX2</name>
              <description>Level 2 Channel Trigger Request Executing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX3</name>
              <description>Level 3 Channel Trigger Request Executing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID</name>
              <description>Active Channel ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABUSY</name>
              <description>Active Channel Busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCNT</name>
              <description>Active Channel Block Transfer Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEADDR</name>
          <description>Descriptor Memory Section Base Address</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>Descriptor Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRBADDR</name>
          <description>Write-Back Memory Section Base Address</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRBADDR</name>
              <description>Write-Back Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHCTRLA%s</name>
          <description>Channel n Control A</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Channel Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Channel Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Channel Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <enumeratedValues>
                <name>TRIGSRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Only software/event triggers</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGACT</name>
              <description>Trigger Action</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TRIGACTSelect</name>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>One trigger required for each block transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <description>One trigger required for each burst transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSACTION</name>
                  <description>One trigger required for each transaction</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURSTLEN</name>
              <description>Burst Length</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>BURSTLENSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single-beat burst length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BEAT</name>
                  <description>2-beats burst length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3BEAT</name>
                  <description>3-beats burst length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BEAT</name>
                  <description>4-beats burst length</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5BEAT</name>
                  <description>5-beats burst length</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6BEAT</name>
                  <description>6-beats burst length</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7BEAT</name>
                  <description>7-beats burst length</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BEAT</name>
                  <description>8-beats burst length</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9BEAT</name>
                  <description>9-beats burst length</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BEAT</name>
                  <description>10-beats burst length</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11BEAT</name>
                  <description>11-beats burst length</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12BEAT</name>
                  <description>12-beats burst length</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13BEAT</name>
                  <description>13-beats burst length</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14BEAT</name>
                  <description>14-beats burst length</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15BEAT</name>
                  <description>15-beats burst length</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BEAT</name>
                  <description>16-beats burst length</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>FIFO Threshold</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>THRESHOLDSelect</name>
                <enumeratedValue>
                  <name>1BEAT</name>
                  <description>Destination write starts after each beat source address read</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BEATS</name>
                  <description>Destination write starts after 2-beats source address read</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BEATS</name>
                  <description>Destination write starts after 4-beats source address read</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BEATS</name>
                  <description>Destination write starts after 8-beats source address read</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHCTRLB%s</name>
          <description>Channel n Control B</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CMD</name>
              <description>Software Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHPRILVL%s</name>
          <description>Channel n Priority Level</description>
          <addressOffset>0x45</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PRILVL</name>
              <description>Channel Priority Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRILVLSelect</name>
                <enumeratedValue>
                  <name>LVL0</name>
                  <description>Channel Priority Level 0 (Lowest Level)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL1</name>
                  <description>Channel Priority Level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL2</name>
                  <description>Channel Priority Level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL3</name>
                  <description>Channel Priority Level 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL4</name>
                  <description>Channel Priority Level 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL5</name>
                  <description>Channel Priority Level 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL6</name>
                  <description>Channel Priority Level 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL7</name>
                  <description>Channel Priority Level 7 (Highest Level)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
